Tekla Open API Reference for Tekla Structures 2025
Phase.SetUserProperty Method (String, String)
 Sets a string property for the phase.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetUserProperty(
	string Name,
	string Value
)
Public Function SetUserProperty (
	Name As String,
	Value As String
) As Boolean
Parameters
Name
Type: System.String
The name of the property to be set, in capital letters.
Value
Type: System.String
The new value for the property.
Return Value
Type: Boolean
True if the property was set successfully.
See Also
Reference
Phase Class
SetUserProperty Overload
Tekla.Structures.Model Namespace